import React from 'react';
import './MyRequests.css';

const MyRequests = () => {
    return (
        <div className="my-requests">
            <h1>Список заявок</h1>
            <table>
                <thead>
                <tr>

                    <th>Станция отправления</th>
                    <th>Станция прибытия</th>
                    <th>Статус</th>
                    <th>Требования</th>
                    <th>Дата/Время</th>
                    <th>ID</th>
                </tr>
                </thead>
                <tbody>
                <tr>
                    <td>Комсомольская</td>
                    <td>Тверская</td>
                    <td>Выполнена</td>
                    <td>Инвалид</td>
                    <td>21.05.2024 10:00</td>
                    <td>20240521-0001</td>
                </tr>
                <tr>
                    <td>Сокол</td>
                    <td>Маяковская</td>
                    <td>Исполняется</td>
                    <td>Инвалид</td>
                    <td>21.05.2024 13:00</td>
                    <td>20240521-0002</td>
                </tr>
                <tr>
                    <td>Красные ворота</td>
                    <td>Некрасовка</td>
                    <td>Исполняется</td>
                    <td>Инвалид</td>
                    <td>21.05.2024 13:30</td>
                    <td>20240521-0003</td>
                </tr>
                <tr>
                    <td>Комсомольская</td>
                    <td>Белорусская</td>
                    <td>Создана</td>
                    <td>Детская коляска + багаж</td>
                    <td>21.05.2024 15:30</td>
                    <td>20240521-0004</td>
                </tr>
                <tr>
                    <td>Строгино</td>
                    <td>Парк Культуры</td>
                    <td>Создана</td>
                    <td>Слабовидящий</td>
                    <td>21.05.2024 17:30</td>
                    <td>20240521-0005</td>
                </tr>
                <tr>
                    <td>Лухмановская</td>
                    <td>Автозаводская</td>
                    <td>Создана</td>
                    <td>Слабовидящий</td>
                    <td>21.05.2024 17:30</td>
                    <td>20240521-0006</td>
                </tr>
                <tr>
                    <td>Окская</td>
                    <td>Технопарк</td>
                    <td>Создана</td>
                    <td>Инвалид</td>
                    <td>21.05.2024 18:00</td>
                    <td>20240521-0007</td>
                </tr>
                {/* Другие строки */}
                <button type="submit">Сотрудники на карте</button>
                </tbody>
            </table>
        </div>
    );
};

export default MyRequests;